Revit 2026 API

# GroupLoadOptionsIncludeLevels Property

---

True if levels should be brought in from the input file, false otherwise. The default value is .

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IncludeLevels { get; set; }
```
```vb
Public Property IncludeLevels As Boolean
	Get
	Set
```
```cpp
public:
property bool IncludeLevels {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IncludeLevels : bool with get, set
```

#### Property Value

Boolean

#### Reference

GroupLoadOptions Class

Autodesk.Revit.DB Namespace